Tutorials/plungingBreaker/kOmega2006/constant/polyMesh/blockMeshDict
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
 
convertToMeters 1.0;
 
vertices
(
(-24.7 -0.4 0)  //4.7 to 24.7, so the total length is around 40m, 
(0 -0.4 0)
(15.95 0.0557 0)
(-24.7 -0.397248 0)  //y plus=30
(0 -0.397248 0)
(15.95 0.058452 0)
(-24.7 -0.39 0)
(0 -0.39 0)
(15.95 0.0657 0)
(-24.7 0.4 0)
(0 0.4 0)
(15.95 0.5557 0)
 
(-24.7 -0.4 0.1)
(0 -0.4 0.1)
(15.95 0.0557 0.1)
(-24.7 -0.397248 0.1)
(0 -0.397248 0.1)
(15.95 0.058452 0.1)
(-24.7 -0.39 0.1)
(0 -0.39 0.1)
(15.95 0.0657 0.1)
(-24.7 0.4 0.1)
(0 0.4 0.1)
(15.95 0.5557 0.1)
);
 
blocks
(
hex (0   1   4   3  12  13  16  15) (2470 1 1) simpleGrading (1 1 1)
hex (1   2   5   4  13  14  17  16) (1998 1 1) simpleGrading (0.625 1 1)
hex (3   4   7   6  15  16  19  18) (2470 2 1) simpleGrading (1 1 1)
hex (4   5   8   7  16  17  20  19) (1998 2 1) simpleGrading (0.625 1 1)
hex (6   7  10   9  18  19  22  21) (2470 79 1) simpleGrading (1 1 1)
hex (7   8  11  10  19  20  23  22) (1998 79 1) simpleGrading (0.625 1 1)
);
 
patches
(
   patch atmosphere
   (
      (9  21  22  10)
      (10  22  23  11)
   )
   patch inlet
   (
      (0  12  15   3)
      (3  15  18   6)
      (6  18  21   9)
   )
   patch outlet
   (
      (2   5  17  14)
      (5   8  20  17)
      (8  11  23  20)
   )
   wall bottom
   (
      (0   1  13  12)
      (1   2  14  13)
   )
   empty frontBack
   (
      (0  3  4  1)
      (1  4  5  2)
      (3  6  7  4)
      (4  7  8  5)
      (6   9  10   7)
      (7  10  11   8)
      (12  13  16  15)
      (13  14  17  16)
      (15  16  19  18)
      (16  17  20  19)
      (18  19  22  21)
      (19  20  23  22)
   )
);
 
mergePatchPairs
(
);
 
