Tutorials/plungingBreaker/kOmega2006/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.00;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet);

initializationName init;

inletCoeffs
{
    // Wave type to be used at boundary "inlet" and in relaxation zone "inlet"
    waveType    streamFunction;  
    
    // Ramp time of 2 s
    Tsoft       0.0;

    // Water depth at the boundary and in the relaxation zone
    depth       0.4;

    specifyPeriod true;
    specifyEuler false;
    stokesVelocity 0.0;
    N 32;
    Niter 32;
    // Wave period
    period      5.0;

    // Phase shift in the wave
    phi         0.000000;

    // Wave number vector, k. 
    direction  (1.0 0.0 0.0);

   // uBar	1.91744;
    // Wave height
    height      0.128;
    
    // Specifications on the relaxation zone shape and relaxation scheme
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (-24.7 0.0 -1);
        endX        (-14.7 0.0  1);
        orientation      (1.0 0.0 0.0);
    }
};

/*outletCoeffs
{
    waveType    potentialCurrent;
    U           (0 0 0);
    Tsoft       2;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (1 0.0 -1);
        endX        (1.2 0.0  1);
        orientation      (1.0 0.0 0.0);
    }*/

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;
}
};



// ************************************************************************* //
